publish/notes/202304110043-LANG.english.sentence-structure-009.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-26 Sun 14:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Structure of a Sentence</title>
<meta name="author" content="ahnaf" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Structure of a Sentence</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org492aae5">1. Clause</a></li>
<li><a href="#org044c07b">2. Subject</a></li>
<li><a href="#orgc33ee53">3. Preposition</a>
<ul>
<li><a href="#orgb700256">3.1. <i>Prepositional Phrases</i></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
A sentence is a group of words that makes sense on its own. A clear and
complete sentence requires these key information: a subject, a verb and a
<b>complete idea</b>.
</p>

<div id="outline-container-org492aae5" class="outline-2">
<h2 id="org492aae5"><span class="section-number-2">1.</span> Clause</h2>
<div class="outline-text-2" id="text-1">
<p>
A clause is a group of words that forms a statement and which <i>may</i> make up
a sentence; a sentence with a <i>complete idea</i> and with a gramatically
correct thought is callend an <b>independent clause</b>.
</p>

<p>
Examples:
</p>

<pre class="example" id="orga550d17">
We went to the store.

Subject: We
Verb: went

Complete idea: says where the verb performed its action.
</pre>

<pre class="example" id="org1ad351f">
We bought the ingredients on our list.

Subject: we
Verb: bought

Complete idea: says how the verb performed its action.
</pre>
</div>
</div>

<div id="outline-container-org044c07b" class="outline-2">
<h2 id="org044c07b"><span class="section-number-2">2.</span> Subject</h2>
<div class="outline-text-2" id="text-2">
<p>
A subject is what a sentence is about. It is either a noun or a pronoun
identifying <i>a person, place, thing, or an idea</i>.
</p>

<pre class="example" id="orga7c0343">
The computer lab is where we will work. It will be open for
twenty-four hours a day.

Subject: computer lab (place)
</pre>

<p>
When subjects refer to a group of people, they are called <i>compound
subjects</i>.
</p>

<pre class="example" id="org08d4c6b">
Books, magazines, and online articles are all good resources.

Compund Subjects: Books, magazines, and online articles
</pre>
</div>
</div>

<div id="outline-container-orgc33ee53" class="outline-2">
<h2 id="orgc33ee53"><span class="section-number-2">3.</span> Preposition</h2>
<div class="outline-text-2" id="text-3">
<p>
If a sentence generally has more than one noun or pronoun chances are it
contains a preposition. <b>Preposition</b> is a word which connects a <span class="underline">noun,
pronoun, or verb</span> to another word that <i>describes or modifies</i> them. Common
prepositions are: in, on, under, near, by, with, until, and about.
</p>
</div>

<div id="outline-container-orgb700256" class="outline-3">
<h3 id="orgb700256"><span class="section-number-3">3.1.</span> <i>Prepositional Phrases</i></h3>
<div class="outline-text-3" id="text-3-1">
<p>
A group of words that begins with a <i>preposition</i> is called a
<b>prepositional phrase</b>. It begins with a preposition to describe or modify
the noun, pronoun, or verb; it cannot act as the subject of a sentence.
</p>

<pre class="example" id="org3bb50ad">
Maya and Tia found an abandoned cat by the side of the road.

Prepositional Phrase: by the side of the road.
</pre>

<pre class="example" id="org7f9ff2b">
The soundtrack has over sixty songs in languages from around the
world.

Prepositional Phrase: in languages from around the world.
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-11-20 Tue 00:00</p>
<p class="author">Author: ahnaf</p>
<p class="date">Created: 2025-01-26 Sun 14:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
